package VezbanjeSah;

public class Figura {
    //2. Апстрактна класа Figura представља фигуру на шаховској табли.
    //Инстанцне променљиве класе су:
    //- boja (типа String)
    //- polje (типа Polje) – поље на шаховској табли на коме се налази фигура
    //Класе Kraljica i Skakac описују врсте фигура које постоје на шаховској табли.
    //У свакој од наведених класа имплементирати:
    //a) конструктор за креирање фигуре на основу задате боје и поља, при чему је потребно бројати
    //колико је креирано белих, а колико црних фигура
    //На табли може постојати највише једна црно/бела краљица и највише два црна/бела скакача.
    //b) метод boolean korektanPotez(Polje p) којим се проверава да ли је померање фигуре на дато
    //поље p коректно.
    //У класи Figura имплементирати метод
    //boolean pomeriFiguru(Polje p)
    //којим се врши померање фигуре на дато поље p – враћа true ако је померање успешно, иначе false.
    //Уколико на пољу p већ постоји нека фигура само исписати поруку „Фигуре се туку“.
    //Имплементирати и метод који враћа String- репрезентацију фигуре.
    //Примери:
    //KraljicaC polje
    //SkakacB polje
}
