package VezbanjeSah;

public class SahovskaTabla {
    //3. Написати тест класу SahovskaTabla у којој се најпре креира шаховска табла – квадратна матрица
    //димензије 8x8 чији су елементи типа Polje.
    //Потом се са стандардног улаза учитава број фигура које ће бити креиране.
    //Фигуре се смештају у низ.
    //Након тога се учитавају фигуре тако што се најпре учита врста фигуре (краљица или скакач).
    //За сваку врсту фигуре учитати боју и при том водити рачуна да се не прекорачи максимални
    //дозвољени број фигура дате врсте у датој боји. У случају неуспеха, поновити унос фигуре.
    //Кад је боја коректно задата, унети и координате поља са шаховске табле на које се поставља дата
    //фигура. Неопходно је проверити коректност задатих координата поља, као и да ли се на том пољу већ
    //налази нека фигура. У случају неуспеха, поновити унос фигуре.
    //Након креирања фигура, 3 пута се случајно бира фигура из датог низа и исписује се њена String
    //репрезентација.
    //Потом се уносе координате поља на које треба померити фигуру. Ако је померање било успешно
    //исписати String репрезентацију фигуре, иначе исписати поруку „Nekorektno pomeranje“
}
